public class Main {
    public static void main(String[] args) {
        //Задание 1
        int age = 19;
        if (age >= 18) {
            System.out.println("Поздравляю - Вы совершеннолетний человек!!!");
        }
        if (age < 18) {
            System.out.println("Возраст совершеннолетия ещё не наступил. У Вас всё впереди!");
        }
        //Задание 2
        int human = 39;
        if (human >=7 && human <=18) {
            System.out.println("Ребенок ходит в школу");
        }
        if (human >=18 && human <=24) {
            System.out.println("Человек уже закончил школу и может отправляться в университет");
        }
        if (human >=24) {
            System.out.println("Человек окончил университет и ему пора искать первую работу");
        }
        }
    }




